Revit 2026 API

# SurfaceElementExtension Enumeration

---

Presets for given Analytical Extension.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SurfaceElementExtension
```
```vb
Public Enumeration SurfaceElementExtension
```
```cpp
public enum class SurfaceElementExtension
```
```fsharp
type SurfaceElementExtension
```

| Member name | Value | Description |
| --- | --- | --- |
| BottomOrTop | 0 | Bottom or Top of physical element. |
| Plane | 1 | Use a Plane for extension (e.g., Grid, Level). |

#### Reference

Autodesk.Revit.DB.Structure Namespace